RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_crm.c
/**
  * @brief  can multi clock source select
  * @param  can_index
  *         this parameter can be one of the following values:
  *         - CRM_CAN1
  *         - CRM_CAN2
  *         - CRM_CAN3
  * @retval crm_can_clock_source_type : the clock source of can index.
  */
crm_can_clock_source_type crm_can_clock_get(crm_can_type can_index)
{
  crm_can_clock_source_type value = CRM_CAN_CLOCK_SOURCE_PCLK;

  switch(can_index)
  {
    case CRM_CAN1:
      value = (crm_can_clock_source_type)CRM->piclks_bit.can1_clksel;
      break;
    case CRM_CAN2:
      value = (crm_can_clock_source_type)CRM->piclks_bit.can2_clksel;
      break;
    case CRM_CAN3:
      value = (crm_can_clock_source_type)CRM->piclks_bit.can3_clksel;
      break;
  }

  return value;
}

/**
  * @brief  config crm pll
  *                        pll_rcs_freq * pll_ns
  *         pll clock = --------------------------------
  *                           pll_ms * pll_fp_n
  *         attemtion:
  *                  31 <= pll_ns <= 500
  *                  1  <= pll_ms <= 15
  *
  *                       pll_rcs_freq
  *         2mhz <=  ---------------------- <= 16mhz
  *                          pll_ms
  *
  *                       pll_rcs_freq * pll_ns
  *         500mhz <=  -------------------------------- <= 1200mhz
  *                               pll_ms
  * @param  clock_source
  *         this parameter can be one of the following values:
  *         - CRM_PLL_SOURCE_HICK
  *         - CRM_PLL_SOURCE_HEXT
  * @param  pll_ns (31~500)
  * @param  pll_ms (1~15)
  * @param  pll_fp
  *         this parameter can be one of the following values:
  *         - CRM_PLL_FP_1
  *         - CRM_PLL_FP_2
  *         - CRM_PLL_FP_4
  *         - CRM_PLL_FP_6
  *         - CRM_PLL_FP_8
  *         - CRM_PLL_FP_10
  *         - CRM_PLL_FP_12
  *         - CRM_PLL_FP_14
  *         - CRM_PLL_FP_16
  *         - CRM_PLL_FP_18
  *         - CRM_PLL_FP_20
  *         - CRM_PLL_FP_22
  *         - CRM_PLL_FP_24
  *         - CRM_PLL_FP_26
  *         - CRM_PLL_FP_28
  *         - CRM_PLL_FP_30
  * @retval none
  */
void crm_pll_config(crm_pll_clock_source_type clock_source, uint16_t pll_ns, \
                    uint16_t pll_ms, crm_pll_fp_type pll_fp)
{
  /* config pll clock source */
  CRM->pllcfg_bit.pllrcs = clock_source;

  /* config pll multiplication factor */
  CRM->pllcfg_bit.pllns = pll_ns;
  CRM->pllcfg_bit.pllms = pll_ms;
  CRM->pllcfg_bit.pllfp = pll_fp;
}

/**
  * @brief  set pllu division when pllu selected as usb clock.
  * @param  pll_fu
  *         this parameter can be one of the following values:
  *         - CRM_PLL_FU_11
  *         - CRM_PLL_FU_12
  *         - CRM_PLL_FU_13
  *         - CRM_PLL_FU_14
  *         - CRM_PLL_FU_16
  *         - CRM_PLL_FU_18
  *         - CRM_PLL_FU_20
  * @retval none
  */
void crm_pllu_div_set(crm_pll_fu_type pll_fu)
{
  CRM->pllcfg_bit.pllfu = pll_fu;
}

/**
  * @brief  config crm pllu output
  * @param  confirm_state
  *         TRUE or FALSE
  * @retval none
  */
void crm_pllu_output_set(confirm_state new_state)
{
  /* config pll clock source type output */
  CRM->pllcfg_bit.plluen = new_state;
}

/**
  * @brief  select system clock source
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  * @retval none
  */
void crm_sysclk_switch(crm_sclk_type value)
{
  /* enable auto step mode */
  crm_auto_step_mode_enable(TRUE);

  CRM->cfg_bit.sclksel = value;

  /* disable auto step mode */
  crm_auto_step_mode_enable(FALSE);
}

/**
  * @brief  indicate which clock source is used as system clock
  * @param  none
  * @retval crm_sclk
  *         this return can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  */
crm_sclk_type crm_sysclk_switch_status_get(void)
{
  return (crm_sclk_type)CRM->cfg_bit.sclksts;
}

/**
  * @brief  get crm clocks freqency
  * @param  clocks_struct
  *         - pointer to the crm_clocks_freq_type structure
  * @retval none
  */
void crm_clocks_freq_get(crm_clocks_freq_type *clocks_struct)
{
  uint32_t pll_ns = 0, pll_ms = 0, pll_fp = 0, pll_clock_source = 0, pllrcsfreq = 0;
  uint32_t temp = 0, div_value = 0, psc = 0;
  crm_sclk_type sclk_source;

  static const uint8_t sclk_ahb_div_table[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
  static const uint8_t ahb_apb1_div_table[8] = {0, 0, 0, 0, 1, 2, 3, 4};
  static const uint8_t ahb_apb2_div_table[8] = {0, 0, 0, 0, 1, 2, 3, 4};
  static const uint8_t pll_fp_table[16] = {1, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30};

  /* get sclk source */
  sclk_source = crm_sysclk_switch_status_get();

  switch(sclk_source)
  {
    case CRM_SCLK_HICK:
      if((CRM->misc1_bit.hick_to_sclk) != RESET)
        clocks_struct->sclk_freq = HICK_VALUE * 6;
      else
        clocks_struct->sclk_freq = HICK_VALUE;

      psc = CRM->misc2_bit.hick_to_sclk_div;
      clocks_struct->sclk_freq = clocks_struct->sclk_freq >> psc;
      break;
    case CRM_SCLK_HEXT:
      clocks_struct->sclk_freq = HEXT_VALUE;
      psc = CRM->misc2_bit.hext_to_sclk_div;
      clocks_struct->sclk_freq = clocks_struct->sclk_freq >> psc;
      break;
    case CRM_SCLK_PLL:
      /* get pll clock source */
      pll_clock_source = CRM->pllcfg_bit.pllrcs;

      /* get multiplication factor */
      pll_ns = CRM->pllcfg_bit.pllns;
      pll_ms = CRM->pllcfg_bit.pllms;
      pll_fp = pll_fp_table[CRM->pllcfg_bit.pllfp];

      if (pll_clock_source == CRM_PLL_SOURCE_HICK)
      {
        /* hick selected as pll clock entry */
        pllrcsfreq = HICK_VALUE;
      }
      else
      {
        /* hext selected as pll clock entry */
        pllrcsfreq = HEXT_VALUE;
      }

      clocks_struct->sclk_freq = (uint32_t)(((uint64_t)pllrcsfreq * pll_ns) / (pll_ms * pll_fp));
      break;
    default:
      clocks_struct->sclk_freq = HICK_VALUE;
      break;
  }

  /* compute sclk, ahbclk, abp1clk and apb2clk frequencies */
  /* get ahb division */
  temp = CRM->cfg_bit.ahbdiv;
  div_value = sclk_ahb_div_table[temp];
  /* ahbclk frequency */
  clocks_struct->ahb_freq = clocks_struct->sclk_freq >> div_value;

  /* get apb1 division */
  temp = CRM->cfg_bit.apb1div;
  div_value = ahb_apb1_div_table[temp];
  /* apb1clk frequency */
  clocks_struct->apb1_freq = clocks_struct->ahb_freq >> div_value;

  /* get apb2 division */
  temp = CRM->cfg_bit.apb2div;
  div_value = ahb_apb2_div_table[temp];
  /* apb2clk frequency */
  clocks_struct->apb2_freq = clocks_struct->ahb_freq >> div_value;
}

/**
  * @brief  set crm clkout
  * @param  clkout
  *         this parameter can be one of the following values:
  *         - CRM_CLKOUT_SCLK
  *         - CRM_CLKOUT_HEXT
  *         - CRM_CLKOUT_PLL
  *         - CRM_CLKOUT_USB
  *         - CRM_CLKOUT_ADC
  *         - CRM_CLKOUT_HICK
  *         - CRM_CLKOUT_LICK
  *         - CRM_CLKOUT_LEXT
  * @retval none
  */
void crm_clock_out_set(crm_clkout_select_type clkout)
{
  if(clkout < 0x10)
  {
    CRM->cfg_bit.clkout_sel1 = (clkout & 0x3);
  }
  else
  {
    CRM->cfg_bit.clkout_sel1 = 0x1;
    CRM->misc1_bit.clkout_sel2 = (clkout & 0xF);
  }
}

/**
  * @brief  set crm clkout1 division1
  * @param  div1
  *         this parameter can be one of the following values:
  *         - CRM_CLKOUT_DIV1_1
  *         - CRM_CLKOUT_DIV1_2
  *         - CRM_CLKOUT_DIV1_3
  *         - CRM_CLKOUT_DIV1_4
  *         - CRM_CLKOUT_DIV1_5
  * @param  div2
  *         this parameter can be one of the following values:
  *         - CRM_CLKOUT_DIV2_1
  *         - CRM_CLKOUT_DIV2_2
  *         - CRM_CLKOUT_DIV2_4
  *         - CRM_CLKOUT_DIV2_8
  *         - CRM_CLKOUT_DIV2_16
  *         - CRM_CLKOUT_DIV2_64
  *         - CRM_CLKOUT_DIV2_128
  *         - CRM_CLKOUT_DIV2_256
  *         - CRM_CLKOUT_DIV2_512
  * @retval none
  */
void crm_clkout_div_set(crm_clkout_div1_type div1, crm_clkout_div2_type div2)
{
  CRM->cfg_bit.clkoutdiv1 = div1;
  CRM->misc1_bit.clkoutdiv2 = div2;
}

/**
  * @brief  set emac output pulse width
  * @param  width
  *         this parameter can be one of the following values:
  *         - CRM_EMAC_PULSE_125MS
  *         - CRM_EMAC_PULSE_1SCLK
  * @retval none
  */
void crm_emac_output_pulse_set(crm_emac_output_pulse_type width)
{
  CRM->misc2_bit.emac_pps_sel = width;
}

/**
  * @brief  config crm interrupt
  * @param  int
  *         this parameter can be any combination of the following values:
  *         - CRM_LICK_STABLE_INT
  *         - CRM_LEXT_STABLE_INT
  *         - CRM_HICK_STABLE_INT
  *         - CRM_HEXT_STABLE_INT
  *         - CRM_PLL_STABLE_INT
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_interrupt_enable(uint32_t crm_int, confirm_state new_state)
{
  if(TRUE == new_state)
    CRM->clkint |= crm_int;
  else
    CRM->clkint &= ~crm_int;
}

/**
  * @brief  calculate the pll parameters with pll reference clock and target pll output frequency.
  *                        pll_rcs_freq * pll_ns
  *         pll clock = --------------------------------
  *                           pll_ms * pll_fp_n
  *         attemtion:
  *                  31 <= pll_ns <= 500
  *                  1  <= pll_ms <= 15
  *
  *                       pll_rcs_freq
  *         2mhz <=  ---------------------- <= 16mhz
  *                          pll_ms
  *
  *                       pll_rcs_freq * pll_ns
  *         500mhz <=  -------------------------------- <= 1200mhz
  *                               pll_ms
  * @param  pll_rcs
  *         this parameter can be one of the following values:
  *         - CRM_PLL_SOURCE_HICK
  *         - CRM_PLL_SOURCE_HEXT
  * @param  target_sclk_freq: target pll output frequency, such as 200 mhz (target_sclk_freq: 200000000)
  * @param  ret_ms: pointer to ms value, return the pll_ms of pll parameters
  * @param  ret_ns: pointer to ns value, return the pll_ns of pll parameters
  * @param  ret_fp: pointer to fr value, return the pll_fp of pll parameters
  * @retval error_status (SUCCESS or ERROR)
  */
error_status crm_pll_parameter_calculate(crm_pll_clock_source_type pll_rcs, uint32_t target_sclk_freq, \
                                         uint16_t *ret_ms, uint16_t *ret_ns, uint16_t *ret_fp)
{
  uint32_t pll_rcs_freq = 0, ns = 0, ms = 0, fp = 0, fp_div = 0;
  uint32_t ms_min = 0, ms_max = 0, error_min = 0xFFFFFFFF;
  uint32_t result = 0, absolute_value = 0;

  /* reduce calculate accuracy, target_sclk_freq accuracy with khz */
  target_sclk_freq = target_sclk_freq / 1000;

  /* get pll reference clock frequency, accuracy with khz */
  if(pll_rcs == CRM_PLL_SOURCE_HICK)
    pll_rcs_freq = HICK_VALUE / 1000;
  else
    pll_rcs_freq = HEXT_VALUE / 1000;

